/*
Пример определения и использования
класса комплексного числа с различными операторами
с демонстрацией внешней компоновки
*/
#include<iostream>
using namespace std;
#include"Chapter10\Example10_07\MComp.h"
int main(){
MComp a,b,c;
double x=1.5, y=2.5;
a.Re=1;
a.Im=2;
b.Re=2;
b.Im=3;
cout<<"******************";
cout<<"\na.Re = "<<a.Re<<"\na.Im = "<<a.Im<<"\n";
cout<<"******************";
cout<<"\nb.Re = "<<b.Re<<"\nb.Im = "<<b.Im<<"\n";
cout<<"******************";
cout<<"\nx = "<<x<<"\ny = "<<y<<"\n";
cout<<"******************";
//Сложение объектов:
c=a+b;
cout<<"\nc=a+b: \n";
cout<<"c.Re = "<<c.Re<<"\nc.Im = "<<c.Im<<"\n";
cout<<"******************";
//Сложение числа и объекта:
c=x+c;
cout<<"\nc=x+c: \n";
cout<<"c.Re = "<<c.Re<<"\nc.Im = "<<c.Im<<"\n";
cout<<"******************";
//Сложение объекта и числа:
c=c+y;
cout<<"\nc=c+y: \n";
cout<<"c.Re = "<<c.Re<<"\nc.Im = "<<c.Im<<"\n";
cout<<"******************";
//Инкремент в префиксной форме:
++c;
cout<<"\n++c: \n";
cout<<"c.Re = "<<c.Re<<"\nc.Im = "<<c.Im<<"\n";
cout<<"******************";
//Инкремент в постфиксной форме:
c++;
cout<<"\nc++: \n";
cout<<"c.Re = "<<c.Re<<"\nc.Im = "<<c.Im<<"\n";
cout<<"******************";
//Вычитание объектов:
c=a-b;
cout<<"\nc=a-b: \n";
cout<<"c.Re = "<<c.Re<<"\nc.Im = "<<c.Im<<"\n";
cout<<"******************";
//Вычитание из числа объекта:
c=x-c;
cout<<"\nc=x-c: \n";
cout<<"c.Re = "<<c.Re<<"\nc.Im = "<<c.Im<<"\n";
cout<<"******************";
//Вычитание из объекта числа:
c=c-y;
cout<<"\nc=c-y: \n";
cout<<"c.Re = "<<c.Re<<"\nc.Im = "<<c.Im<<"\n";
cout<<"******************";
//Декремент в префиксной форме:
--c;
cout<<"\n--c: \n";
cout<<"c.Re = "<<c.Re<<"\nc.Im = "<<c.Im<<"\n";
cout<<"******************";
//Декремент в постфиксной форме:
c--;
cout<<"\nc--: \n";
cout<<"c.Re = "<<c.Re<<"\nc.Im = "<<c.Im<<"\n";
cout<<"******************";
//Комплексно-сопряженное:
!a;
cout<<"\n!a: \n";
cout<<"a.Re = "<<a.Re<<"\na.Im = "<<a.Im<<"\n";
cout<<"******************\n";
return 0;
}